In [1]:
import numpy as np
import pandas as pd

In [26]:
outside=['A1','A1','A1','A2','A2','A2','A3','A3','A3']
inside=[1,2,3,1,2,3,1,2,3]
main_index=list(zip(outside,inside))
main_index=pd.MultiIndex.from_tuples(main_index)

In [27]:
main_index

MultiIndex([('A1', 1),
            ('A1', 2),
            ('A1', 3),
            ('A2', 1),
            ('A2', 2),
            ('A2', 3),
            ('A3', 1),
            ('A3', 2),
            ('A3', 3)],
           )

In [29]:
df=pd.DataFrame(np.random.randn(9,2),index=main_index,columns=['A','B'])

In [30]:
df

             A         B
A1 1  0.029633  1.392355
   2 -0.125229 -0.583579
   3 -0.851438 -0.094985
A2 1 -1.048755  0.451231
   2  0.987246 -0.309533
   3 -0.346691 -0.490125
A3 1  0.635575 -0.792662
   2  1.443581  1.802002
   3 -0.391189  0.333683

In [31]:
df.loc['A1']

          A         B
1  0.029633  1.392355
2 -0.125229 -0.583579
3 -0.851438 -0.094985

In [41]:
df.loc['A1'].loc[[1,2,3]]

            A         B
Num
1    0.029633  1.392355
2   -0.125229 -0.583579
3   -0.851438 -0.094985

In [42]:
df.loc['A2'].loc[[2,3]]

            A         B
Num
2    0.987246 -0.309533
3   -0.346691 -0.490125

In [33]:
df.index.names

FrozenList([None, None])

In [34]:
df.index.names=['Group','Num']

In [35]:
df

                  A         B
Group Num
A1    1    0.029633  1.392355
      2   -0.125229 -0.583579
      3   -0.851438 -0.094985
A2    1   -1.048755  0.451231
      2    0.987246 -0.309533
      3   -0.346691 -0.490125
A3    1    0.635575 -0.792662
      2    1.443581  1.802002
      3   -0.391189  0.333683

In [36]:
df.xs('A1')

            A         B
Num
1    0.029633  1.392355
2   -0.125229 -0.583579
3   -0.851438 -0.094985

In [43]:
df.xs(('A1',2))

A   -0.125229
B   -0.583579
Name: (A1, 2), dtype: float64

In [45]:
df.xs(('A1',1))

A    0.029633
B    1.392355
Name: (A1, 1), dtype: float64

In [38]:
df.xs(2,level='Num')

              A         B
Group
A1    -0.125229 -0.583579
A2     0.987246 -0.309533
A3     1.443581  1.802002

In [46]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [47]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [49]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [54]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [55]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [56]:
df.fillna(value="fillvalue")

           A          B  C
0        1.0        5.0  1
1        2.0  fillvalue  2
2  fillvalue  fillvalue  3

In [60]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_5920\1576873578.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(value=df['A'].mean(),inplace=True)

In [61]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [68]:
df['A'].fillna(value=2)

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64